[
    {
        "projectName" : "Hash Bio",
        "techStack" : [
            "Confidential"
        ],
        "collaborators" :[
            "Jonathan Powell", "Joseph Jophy", "Mike Odnis", "Yikai Liu", "Ken Ng"
        ],
        "description" : "A central hub that is built for social media influencers that are looking to increase their exposure to the public, track and calculate engagement rates to strategically cater their content to their demographic audience, and mint their social media posts as NFTs to avoid payola if their content is affiliated with a brand or company",
        "liveLink" : "",
        "sourceCodeLink" : "",
        "youtubeLink" : "",
        "development": "Internship",
        "note": "Internship project currently under development. Additionally, technology stack and source code cannot be revealed due to a signed NDA with the company (Social PayMe). Live link will be displayed once production build is published and stack will be disclosed during the interview process",
        "isConfidential": true
    },

    {
        "projectName" : "Fast Tracker",
        "techStack" : [
            "React", "Firebase", "Vite", "QR Code"

        ],
        "collaborators" :[

        ],
        "description" : "A tool that streamlines the process of taking attendance through the use of QR codes. This application is developed for an organization hosting large events with the requirement of taking attendance quickly and reliably. To use this application, the organization and attendee must preferrably have a mobile phone. The attendee shows their QR code in which the application scans the QR code which registers the attendee in the Firebase database. ",
        "liveLink" : "https://fasttracker.netlify.app/",
        "sourceCodeLink" : "https://github.com/MekhiHart/fast-tracker",
        "youtubeLink" : "https://www.youtube.com/embed/8gwzAvs_lgU?enablejsapi=1&amp;origin=https%3A%2F%2Fwww.danny-berger.dev&amp;widgetid=1",
        "development":"Hackathon",
        "note":"Project submited in a 24 hour hackathon affiliated with my University that won best Google Cloud Hack",
        "isConfidential": false
    },

    {
        "projectName" : "BeachHacks Schedule",
        "techStack" : [
            "React", "MongoDB", "Node.js", "Express.js"
        ],
        "collaborators" :[
            "Dening", "Carine Gordillo", "Jasmine San Juan", "Leslie Ortega"
        ],
        "description" : "A MERN application built for the BeachHacks organization that tracks the popularity of events and workshops hosted by the organization. The data is used by the data analyis team to make improvements to future events and workshops ",
        "liveLink" : "https://www.beachhacks-schedule.com/",
        "sourceCodeLink" : "https://github.com/BeachHacks/schedule-alert-2023",
        "youtubeLink" : "https://www.youtube.com/embed/8gwzAvs_lgU?enablejsapi=1&amp;origin=https%3A%2F%2Fwww.danny-berger.dev&amp;widgetid=1",
        "development" : "Computer Science Organization",
        "note": "Production build has been archived. Backend and API endpoints has been disconnected to avoid manipulating data for the data analysis team",
        "isConfidential" :false
    }

]