[
    {
        "projectName" : "Hash Bio",
        "techStack" : [
            "Confidential"
        ],
        "collaborators" :[
            "Jonathan Powell", "Joseph Jophy", "Mike Odnis", "Yikai Liu", "Ken Ng"
        ],
        "description" : "A central hub built for social media influencers that are looking to increase their exposure to the public, track and calculate engagement rates to strategically cater their content to their demographic audience, and mint their social media posts as NFTs to avoid payola if their content is affiliated with a brand or company",
        "liveLink" : "",
        "sourceCodeLink" : "",
        "youtubeLink" : "",
        "companyWebsite": "https://www.socialpayme.com/",
        "development": "Internship",
        "note": "Internship project with Social Payme. Source code cannot be revealed due to a signed NDA with the company. Live link will be displayed once production build is deployed. Technology stack will be disclosed during an interview process",
        "isConfidential": true
    },

    {
        "projectName" : "Fast Tracker",
        "techStack" : [
            "TypeScript","React", "Firebase", "Vite"

        ],
        "collaborators" :[

        ],
        "description" : "An attendance tracker tool that streamlines the process through QR codes. This application is developed for large events with the requirement of taking attendance quickly and reliably. Project submitted for a Google affiliated hackathon and won Best Google Cloud Hack, while competing against 109 competitors",
        "liveLink" : "https://fasttracker.netlify.app/",
        "sourceCodeLink" : "https://github.com/MekhiHart/fast-tracker",
        "youtubeLink" : "https://www.youtube.com/embed/m-QqPMXl9Wg",
        "development":"Hackathon",
        "note":"If testing out live code, I recommend having two seperate devices. One device to scan the QR code, and another device to generate the QR code. 'test' is the id used for both attendee and volunteer user for demonstration purposes. See video for more information",
        "isConfidential": false
    },

    {
        "projectName" : "BeachHacks Schedule",
        "techStack" : [
            "JavaScript","React", "MongoDB", "Node.js", "Express.js", "REST API"
        ],
        "collaborators" :[
            "Dening", "Carine Gordillo", "Jasmine San Juan", "Leslie Ortega"
        ],
        "description" : "A full-stack web application (MERN) built for the BeachHacks organization that tracks the popularity of events and workshops hosted by the organization. The data was used by the data analysis team to generate a report that will be used to make improvements to future events and workshops ",
        "liveLink" : "https://www.beachhacks-schedule.com/",
        "sourceCodeLink" : "https://github.com/BeachHacks/schedule-alert-2023",
        "youtubeLink" : "https://www.youtube.com/embed/dotNfCt43Uo",
        "development" : "Computer Science Organization",
        "note": "Repository has been archived and API endpoints has been removed but front-end is still available.",
        "isConfidential" :false
    }

]